app/views/movies/index.html.erb

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."user_id" = ? AND "user_movies"."movie_id" = ? LIMIT ?  [["user_id", 1], ["movie_id", 1], ["LIMIT", 1]]
---
    <p>Average Score: <%= movie.average_score %></p>
    <%= form_for(current_user.user_movies.find_or_initialize_by(movie_id: movie.id), remote: true) do |f| %>