app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "m1"], ["director", "d1"], ["created_at", "2024-03-19 08:47:53.707598"], ["updated_at", "2024-03-19 08:47:53.707598"]]
---
  def create
    puts "MovieParams!"
    puts movie_params
    @movie = Movie.new(movie_params)
    if @movie.save