app/controllers/user_movies_controller.rb

  def create
    @movie = Movie.find(params[:user_movie][:movie_id])
    current_user.movies << @movie
    @user_movie = current_user.user_movies.find_by(movie_id: @movie.id)
    @user_movie.update(score: params[:user_movie][:score])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "user_movies" ("user_id", "movie_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["movie_id", 1], ["score", nil], ["created_at", "2024-03-19 08:47:57.352537"], ["updated_at", "2024-03-19 08:47:57.352537"]]
SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."user_id" = ? AND "user_movies"."movie_id" = ? LIMIT ?  [["user_id", 1], ["movie_id", 1], ["LIMIT", 1]]
UPDATE "user_movies" SET "score" = ?, "updated_at" = ? WHERE "user_movies"."id" = ?  [["score", 4], ["updated_at", "2024-03-19 08:47:57.360545"], ["id", 1]]